/*
 * Логічні оператори (&& || !)
 */

//* && - запинається на брехні
//* Якщо операнд був преведенний до false, то повертається значення цього операнду.
//* Якщо всі операнди були приведені до true, то повертається значення останнього операнду.

// const result = 0 && 20 && 'Hello!';

// console.log(result);

//* || - запинається на правді
//* Якщо операнд був преведенний до true, то повертається значення цього операнду.
//* Якщо всі операнди були приведені до false, то повертається останній.

// const result = 0 || false || null;

// console.log(result);

//* ! - інвертує правду до брехні, а брехню до правди
// console.log(!'Hello!');
